Repository: pypi-data/pypi-mirror-81
Catalog: packages/cubicweb-signedrequest/cubicweb-signedrequest-1.0.0.tar.gz/cubicweb-signedrequest-1.0.0/cubicweb_signedrequest/i18n/*.po
Languages: fr

source: AuthToken
fr: Jeton d'authentification

source: AuthToken_plural
fr: Jetons d'authentification

source: Authentication token
fr: Jeton d'authentification

source: New AuthToken
fr: Nouveau jeton d'authentification

source: This AuthToken
fr: Ce jeton d'authentification

source: This AuthToken:
fr: Ce jeton d'authentification :

source: add AuthToken token_for_user CWUser object
fr: jeton d'authentification

source: add a AuthToken
fr: ajouter un jeton d'authentification

source: creating AuthToken (AuthToken token_for_user CWUser %(linkto)s)
fr: Création d'un jeton d'authentification pour l'utilisateur %(linkto)s

source: enabled
fr: actif

# AuthToken
source: enabled
fr: actif

source: id
fr: identifiant

# AuthToken
source: id
fr: identifiant

source: identifier for the token (must be unique)
fr: identifiant pour ce jeton (doit être unique)

source: secret token
fr: secret du jeton

source: token
fr: jeton

# AuthToken
source: token
fr: jeton

source: token_for_user
fr: utilisateur

# AuthToken
source: token_for_user
fr: utilisateur

source: token_for_user_object
fr: jeton d'authentification

# CWUser
source: token_for_user_object
fr: jeton d'authentification
