Repository: pypi-data/pypi-mirror-81
Catalog: packages/collective.wfadaptations/collective.wfadaptations-1.0.tar.gz/collective.wfadaptations-1.0/src/collective/wfadaptations/locales/*/LC_MESSAGES/collective.wfadaptations.po
Languages: fr

source: Add a new workflow adaptation
fr: Ajouter une nouvelle adaptation à un workflow

source: Already applied workflow adaptations
fr: Adaptations de workflow déjà appliquées

source: Associate an adaptation to a workflow
fr: Associer une adaptation à un workflow

source: Choose parameters for your workflow adaptation
fr: Choisissez les paramètres pour votre adaptation de workflow

source: Manage workflow adaptations
fr: Gestion des adaptations de workflow

source: The workflow adaptation has been successfully applied.
fr: L'adaptation de workflow a été appliquée avec succès.

source: The workflow adaptation has not been successfully applied.
fr: L'adaptation de workflow n'a pas pu être appliquée.

source: The workflow id '${id}' (${title}) doesn't contain the state '${state}'.
fr: Le workflow '${id}' (${title}) ne contient pas l'état '${state}'.

source: The workflow id '${id}' (${title}) doesn't contain the transition '${transition}'.
fr: Le workflow '${id}' (${title}) ne contient pas la transition '${transition}'.

source: There is no applied workflow adaptations for now.
fr: Il n'y a aucune adaptation de workflow.

source: This adaptation is already applied on this workflow.
fr: Cette adaptation a déjà été appliquée sur ce workflow.

source: Workflow adaptation
fr: Adaptation de workflow

source: Workflow adaptation to execute on this workflow
fr: Adaptation de workflow à exécuter sur ce workflow
