Repository: pypi-data/pypi-mirror-81
Catalog: packages/weblate-language-data/weblate-language-data-2020.10.tar.gz/weblate-language-data-2020.10/weblate_language_data/locale/*/LC_MESSAGES/django.po
Languages: kk

source: Abkhazian
kk: Abhaz

source: Acehnese
kk: Acheh

source: Acholi
kk: Acholı

source: Adyghe
kk: Adygeı

source: Avestan
kk: Avesta

source: Amharic
kk: Amhar

source: Aragonese
kk: Aragon

source: Arabic
kk: Arab

source: Arabic (Bahrain)
kk: Arab (Bahreın)

source: Arabic (Algeria)
kk: Arab (Aljır)

source: Arabic (Egypt)
kk: Arab (Mysyr)

source: Arabic (Kuwait)
kk: Arab (Kýveıt)

source: Arabic (Morocco)
kk: Arab (Marok)

source: Arabic (Saudi Arabia)
kk: Arab (Saýdı Arabstan)

source: Arabic (Yemen)
kk: Arab (Iemen)

source: Assamese
kk: Asam

source: Asu
kk: Asý

source: Asturian
kk: Asturı

source: Avaric
kk: Avar

source: Aymará
kk: Aımara

source: Azerbaijani
kk: Ázirbaıjan

source: Bashkir
kk: Bashqurt

source: Bavarian
kk: Bavar nemis

source: Belarusian
kk: Belarus

source: Belarusian (latin)
kk: Belarus (latyn)

source: Bulgarian
kk: Bolǵar

source: Bihari
kk: Bıharı

source: Bhojpuri
kk: бходжпури тілі

source: Bislama
kk: Bıslama

source: Bengali
kk: Bengalı

source: Bengali (Bangladesh)
kk: Bengalı (Bańladesh)

source: Bengali (India)
kk: Bengalı (Úndistan)

source: Tibetan
kk: Tıbet

source: Bosnian
kk: Bosnaq

source: Bosnian (cyrillic)
kk: Bosnaq (kırıl)

source: Bosnian (latin)
kk: Bosnaq (latyn)

source: Bilen
kk: Bılen

source: Catalan
kk: Katalan

source: Valencian
kk: Valensı

source: Chechen
kk: Sheshen

source: Cebuano
kk: Sebuano

source: Chiga
kk: Chıga

source: Chamorro
kk: Chamoro

source: Chuukese
kk: чуук тілі

source: Mari
kk: Marı

source: Cherokee
kk: Cherokı

source: Corsican
kk: Korsıkan

source: Cree
kk: Krı

source: Crimean Tatar
kk: Qyrymtatar

source: Czech
kk: Cheh

source: Kashubian
kk: Kashub

source: Old Church Slavonic
kk: Shirkeýslaván

source: Welsh
kk: Ýelsh

source: Danish
kk: Dat

source: German
kk: Nemis

source: Dogri
kk: Dogrı

source: Lower Sorbian
kk: Tómengi sorb

source: Dhivehi
kk: Dhıvehı

source: Dzongkha
kk: Dzońke

source: Ewe
kk: Eýe

source: Greek
kk: Grek

source: English
kk: Aǵylshyn

source: English (Australia)
kk: Aǵylshyn (Aýstralıa)

source: English (Canada)
kk: Aǵylshyn (Kanada)

source: English (United Kingdom)
kk: Aǵylshyn (Qurama Koróldik)

source: English (Ireland)
kk: Aǵylshyn (Irlandıa)

source: English (India)
kk: Aǵylshyn (Úndistan)

source: English (New Zealand)
kk: Aǵylshyn (Jańa Zelandıa)

source: English (Philippines)
kk: English (Fılıpınder)

source: English (United States)
kk: Aǵylshyn (AQSh)

source: English (South Africa)
kk: Aǵylshyn (OAR)

source: Spanish
kk: Ispan

source: Spanish (Latin America)
kk: Ispan (Latyn Amerikasy)

source: Spanish (Argentina)
kk: Ispan (Argentına)

source: Spanish (Chile)
kk: Ispan (Chılı)

source: Spanish (Dominican Republic)
kk: Ispan (Domınıkan Respublıkasy)

source: Spanish (Ecuador)
kk: Ispan (Ekýador)

source: Spanish (Mexico)
kk: Ispan (Meksıka)

source: Spanish (Peru)
kk: Ispan (Perý)

source: Spanish (Puerto Rico)
kk: Ispan (Puerto-Rıko)

source: Spanish (American)
kk: Ispan (AQSh)

source: Estonian
kk: Eston

source: Basque
kk: Baski

source: Persian
kk: Parsy

source: Dari
kk: Darı

source: Finnish
kk: Fın

source: Filipino
kk: Fılıpın

source: Fijian
kk: Fıjı

source: Faroese
kk: Farer

source: French
kk: Fransýz

source: French (Belgium)
kk: Fransýz (Belgıa)

source: French (Canada)
kk: Fransýz (Kanada)

source: French (Switzerland)
kk: Fransýz (Shveısarıa)

source: Franco-Provençal
kk: Fransýz-Provansál

source: Friulian
kk: Frıulı

source: Frisian
kk: Frız

source: Irish
kk: Irland

source: Gaelic
kk: Gaelık

source: Ge'ez
kk: Gehez

source: Galician
kk: Galısı

source: Guarani
kk: Gýaranı

source: Gujarati
kk: Gujaratı

source: Gun
kk: Gýn

source: Manx
kk: Mens

source: Hausa
kk: Haýsa

source: Hawaiian
kk: Gavaı

source: Hebrew
kk: Ivrıt

source: Hindi
kk: Hındı

source: Hiligaynon
kk: Hılıgaınon

source: Chhattisgarhi
kk: Chatısgarhı

source: Hiri Motu
kk: Hırı-motý

source: Croatian
kk: Horvat

source: Hunsrik
kk: Húnsrik

source: Upper Sorbian
kk: Joǵarǵy sorb

source: Haitian
kk: Gaıtı

source: Hungarian
kk: Majar

source: Armenian
kk: Armán

source: Herero
kk: Gerero

source: Interlingua
kk: Interlıngýa

source: Indonesian
kk: Indonezı

source: Occidental
kk: Oksıdentál

source: Inupiaq
kk: Inupıaq

source: Icelandic
kk: Island

source: Italian
kk: Italıan

source: Japanese
kk: Japon

source: Japanese (Kansai)
kk: Japon (Kansaı)

source: Jamaican Patois
kk: Iamaı-kreol

source: Ngomba
kk: Ńomba

source: Javanese
kk: Iavan

source: Georgian
kk: Grýzin

source: Kabyle
kk: Kabıl

source: Jju
kk: Ju

source: Tyap
kk: Tıap

source: Kabuverdianu
kk: Kabuverdıaný

source: Gikuyu
kk: Kikýıý

source: Kwanyama
kk: Kýanıama

source: Kazakh
kk: Qazaq

source: Greenlandic
kk: Grenland

source: Central Khmer
kk: Ortalyq hmer

source: Korean
kk: Koreı

source: Konkani
kk: Konkanı

source: Kanuri
kk: Kanurı

source: Kashmiri
kk: Kashmırı

source: Colognian
kk: Kóln nemis

source: Kurdish
kk: Kúrt

source: Komi
kk: Komı

source: Cornish
kk: Korn

source: Kyrgyz
kk: Qyrǵyz

source: Latin
kk: Latyn

source: Langi
kk: Langı

source: Luxembourgish
kk: Lúksembor

source: Limburgish
kk: Lımbor

source: Lingala
kk: Lıngala

source: Lao
kk: Laos

source: Lithuanian
kk: Lıtva

source: Latvian
kk: Latysh

source: Maithili
kk: Maıthılı

source: Masai
kk: Masaı

source: Montenegrin
kk: Chernogor

source: Morisyen
kk: Mavrıkı-kreol

source: Malagasy
kk: Malagası

source: Metaʼ
kk: Menchým

source: Marshallese
kk: Marshál

source: Meadow Mari
kk: Kógal marı

source: Maori
kk: Maorı

source: Miami
kk: Maıamı-ılınoıs

source: Macedonian
kk: Makedon (zamanaýı)

source: Malayalam
kk: Malaıalam

source: Mongolian
kk: Mońǵol

source: Manipuri
kk: Manıpurı

source: Mandinka
kk: Mandınka

source: Marathi
kk: Marathı

source: Malay
kk: Malaı

source: Maltese
kk: Málta

source: Burmese
kk: Bırman

source: Nauru
kk: Naýrý

source: Nahuatl
kk: Nahuátl

source: Chinese (Min Nan)
kk: Hanzý (Mın-Nan)

source: Neapolitan
kk: Neapolıtan

source: Norwegian Bokmål
kk: Norveg (býkmol)

source: North Ndebele
kk: Soltústik ndebele

source: Nepali
kk: Nepalı

source: Dutch
kk: Nıderland

source: Norwegian Nynorsk
kk: Norveg (núnoshk)

source: Ngiemboon
kk: Ńıembýn

source: N’Ko
kk: Ńko

source: South Ndebele
kk: Ońtústik ndebele

source: Pedi
kk: Pedı

source: Nyanja
kk: Nıanja

source: Nyankole
kk: Nıankole

source: Occitan
kk: Oksıtan

source: Ojibwe
kk: Ojıbýe

source: Odia
kk: Orıa

source: Ossetian
kk: Osetın

source: Punjabi
kk: Panjabı

source: Papiamento
kk: Papıamento

source: Palauan
kk: палау тілі

source: Pali
kk: Palı

source: Polish
kk: Polák

source: Piemontese
kk: Pıemont

source: Pirate
kk: Pırat

source: Prussian
kk: Prus

source: Pashto
kk: Pýshtý

source: Portuguese
kk: Portýgal

source: Portuguese (Angola)
kk: Portýgal (Angola)

source: Portuguese (Brazil)
kk: Portýgal (Brazılıa)

source: Portuguese (Portugal)
kk: Portýgal (Portýgalıa)

source: Quechua
kk: Kechýa

source: Rundi
kk: Rundı

source: Romanian
kk: Rýmyn

source: Moldavian
kk: Rýmyn (Moldova)

source: Russian
kk: Orys

source: Rusyn
kk: Rusın

source: Kinyarwanda
kk: Kınıarýanda

source: Rwa
kk: Rýa

source: Sanskrit
kk: Sanskrıt

source: Yakut
kk: Saha

source: Samburu
kk: Sambýrý

source: Santali
kk: Santalı

source: Sardinian
kk: Sardın

source: Scots
kk: Skots

source: Sindhi
kk: Sındhı

source: Southern Kurdish
kk: Ońtústik kúrt

source: Northern Sami
kk: Soltústik samı

source: Koyraboro Senni
kk: Koıraboro-sennı

source: Tachelhit
kk: Tashelhıt

source: Sinhala
kk: Sıngal

source: Slovenian
kk: Sloven

source: Southern Sami
kk: Ońtústik samı

source: Sami
kk: Samı

source: Lule Sami
kk: Lule-samı

source: Inari Sami
kk: Inarı-samı

source: Skolt Sami
kk: Kolta-samı

source: Somali
kk: Somalı

source: Songhai
kk: Sońǵaı

source: Albanian
kk: Alban

source: Serbian
kk: Serb

source: Serbian (cyrillic)
kk: Serb (kırıl)

source: Serbian (latin)
kk: Serb (latyn)

source: Swati
kk: Sýatı

source: Southern Sotho
kk: Ońtústik soto

source: Sundanese
kk: Sunda

source: Swedish
kk: Shved

source: Swahili
kk: Sýahılı

source: Syriac
kk: Sırıa (zamanaýı)

source: Silesian
kk: Sılez

source: Tamil
kk: Tamıl

source: Tamil (Sri Lanka)
kk: Tamıl (Shrı-Lanka)

source: Telugu
kk: Telýgý

source: Tajik
kk: Tájik

source: Thai
kk: Taı

source: Tigrinya
kk: Tıgrınıa

source: Tigre
kk: Tıgre

source: Turkmen
kk: Túrkmen

source: Klingon (pIqaD)
kk: Klıngon (klıngon jazýy)

source: Klingon
kk: Klıngon

source: Tswana
kk: Sýana

source: Turkish
kk: Túrik

source: Tsonga
kk: Songa

source: Twi
kk: Týı

source: Tahitian
kk: Tahıtı

source: Central Atlas Tamazight
kk: Orta-Atlas tamazıǵt

source: Uyghur
kk: Uıǵyr

source: Ukrainian
kk: Ýkraın

source: Urdu
kk: Urdý

source: Urdu (Pakistan)
kk: Urdý (Pákistan)

source: Uzbek
kk: Ózbek

source: Uzbek (latin)
kk: Ózbek (latyn)

source: Venetian
kk: Venet (zamanaýı)

source: Vietnamese
kk: Vıetnam

source: West Flemish
kk: Batys flamand

source: Volapük
kk: Volapúk

source: Walloon
kk: Valon

source: Wolaytta
kk: Volamo

source: Sorbian
kk: Sorb

source: Wolof
kk: Ýolof

source: Xhosa
kk: Hosa

source: Yiddish
kk: Idısh

source: Yoruba
kk: Ioruba

source: Yue
kk: Iýe

source: Zhuang
kk: Juań

source: Chinese (Simplified)
kk: Hanzý (jeńil)

source: Chinese (Traditional)
kk: Hanzý (dástúr)

source: Zulu
kk: Zulus
