Repository: pypi-data/pypi-mirror-81
Catalog: packages/abilian-crm-core/abilian-crm-core-0.1.28.tar.gz/abilian-crm-core-0.1.28/abilian/crm/translations/*/LC_MESSAGES/messages.po
Languages: fr

source: postal_address_street_lines
fr: Rue

source: postal_address_street_lines_help
fr: Numéro, rue, batiment, …

source: postal_address_administrative_area
fr: État (si applicable)

source: postal_address_administrative_area_help
fr: État / Province / Région / BP Militaire / …

source: postal_address_sub_administrative_area
fr: Comté (si applicable)

source: postal_address_sub_administrative_area_help
fr: Comté / District

source: postal_address_postal_code
fr: Code postal

source: postal_address_postal_code_help
fr: Code postal / ZIP

source: postal_address_locality
fr: Ville

source: postal_address_country
fr: Pays

source: phonenumber_type
fr: Type

source: phonenumber_type_help
fr: Standard, Fax, Pro, Mobile…

source: phonenumber_number
fr: Numéro

source: for an extension number add "#1234"
fr: pour une extension (numéro de poste...) ajouter "#1234"

source: This field is required
fr: Ce champ est obligatoire

source: Invalid cell format, value: {value}
fr: Format invalide pour cette cellule, value: {value}

source: "{value}" is invalid. Valid choices are: {valid}
fr: "{value}" n'est pas un choix valide. Choix possibles: {valid}

source: An error happened during generation of file.
fr: Une erreur est survenue pendant la création du fichier d'export.

source: No change detected in file {filename}
fr: Aucun changement détecté dans le fichier {filename}

source: Export to Excel
fr: Export Excel

source: Year
fr: Année

source: Generating file
fr: Création du fichier

source: Waiting to start
fr: L'export va démarrer
