Repository: pypi-data/pypi-mirror-81
Catalog: packages/pas.plugins.imio/pas.plugins.imio-1.0.4.tar.gz/pas.plugins.imio-1.0.4/src/pas/plugins/imio/locales/*/LC_MESSAGES/pas.plugins.imio.po
Languages: fr

source: Installs the pas.plugins.imio add-on.
fr: Installer pas.plugins.imio

source: Installs the pas.plugins.imio base add-on.
fr: Installer pas.plugins.imio base

source: Provider User ID for Authentic
fr: Provider User ID pour Authentic

source: Uninstalls the pas.plugins.imio add-on.
fr: Désinstaller pas.plugins.imio

source: add_identity_title
fr: Ajout de l'identité

source: added_identity
fr: Ajout de l'identité donnée par ${provider}

source: help_full_name_creation
fr: Entrer le nom complet, par exemple, John Smith

source: label_email
fr: E-mail

source: label_full_name
fr: Nom complet

source: logged_in_with
fr: Se connecter avec ${provider}

source: login_title
fr: Se connecter avec <span>Wallonie Connect</span>

source: pas.plugins.imio (uninstall)
fr: pas.plugins.imio (désinstaller)
