Repository: pypi-data/pypi-mirror-81
Catalog: packages/ubcpi-xblock/ubcpi_xblock-1.0.0-py3.7.egg/ubcpi/translations/*/LC_MESSAGES/text.po
Languages: de_de, eo

source: "Simple" means examples for different answer possibilities are intentionally selected when students are viewing peer answers.<br>"Random" means examples are selected at random and may not include different answer possibilities.
de_de: "Einfach" bedeutet, dass Beispiele für verschiedene Antwortmöglichkeiten absichtlich ausgewählt werden, wenn die Schülerinnen und Schüler die Antworten von anderen ansehen.<br> "Zufällig" bedeutet, dass die Beispiele nach dem Zufallsprinzip ausgewählt werden und möglicherweise nicht verschiedene Antwortmöglichkeiten enthalten.

source: (You chose this option)
de_de: (Sie wählen diese Option)

source: (including you)
de_de: (Sie eingeschlossen)

source: ({{weight}} point possible)
de_de: ({{weight}} Punkt möglich)

source: ({{weight}} points possible)
de_de: ({{weight}} mögliche Punkte)

source: , Completed
de_de: , Fertiggestellt

source: , In Progress
de_de: , Wird Bearbeitet

source: , Upcoming
de_de: , Bevorstehend

source: Add Image To Question
de_de: Ein Bild zur Frage hinzufügen

source: Add New Answer
de_de: Eine neue Antwort hinzufügen

source: Add New Example
de_de: Ein neues Beispiel hinzufügen

source: Add example answers to the answer pool for this question. Students most likely to see these answers are those completing the assignment first, when the answer pool is small.
de_de: Fügen Sie Beispielantworten zu dem Antwortenpool dieser Frage hinzu. Es ist vielleicht hilfreich für Teilnehmer diese Antworten zu sehen.

source: Add the text for this answer. If you wish to add an image, press the button below.
de_de: Fügen Sie einen Antworttext hinzu. Wenn Sie möchten, können Sie auch ein Bild einfügen. Dazu die Schaltfläche unten benutzen.

source: Alternative text - a description of the image for non-visual users. The description should provide all the information needed for someone to answer the question if the image did not load.
de_de: Alternativer Text - eine Beschreibung des Bildes für einen blinden Nutzer. Diese Beschreibung sollte den Nutzer mit allen relevanten Informationen versorgen, welche benötigt werden, um die Frage zu beantworten.

source: Answer
de_de: Antwort

source: Answer {{$index + 1}}
de_de: Antwort {{$index + 1}}

source: Answers Students See - Number Selected <font color="red">*</font>
de_de: Antworten, die ein Teilnehmer sieht - Ausgewählte Anzahl <font color="red">*</font>

source: Answers Students See - Selection Logic <font color="red">*</font>
de_de: Antworten, die ein Teilnehmer sieht - Ausgewählte Reihenfolge <font color="red">*</font>

source: Cancel
de_de: Löschen

source: Choose if you want the image to appear above or below the question text.
de_de: Wählen Sie, ob das Bild ober- oder unterhalb des Fragetextes erscheinen soll.

source: Choose if you want the image to appear above or below the question.
de_de: Wählen Sie, ob das Bild ober- oder unterhalb der Frage erscheinen soll.

source: Choose the answer you consider correct, or select "n/a" if there is no correct answer.
de_de: Wählen Sie die richtige Antwort aus oder wählen Sie "n/a", wenn es keine richtige Antwort gibt.

source: Choose the answer.
de_de: Wählen Sie die Antwort

source: Chose after revision
de_de: Nach der Revision gewählt

source: Chose initially
de_de: Zu Beginn gewählt

source: Correct Answer <font color="red">*</font>
de_de: Richtige Antwort <font color="red">*</font>

source: Correct Answer:
de_de: Richtige Antwort:

source: Correct Option
de_de: Richtige Option

source: Defines the number of points each problem is worth. If the value is not set, the problem is worth the sum of the option point values.
de_de: Legt die Anzahl der Punkte fest, die jede Fragestellung wert ist. falls der Wert nicht gesetzt ist, ist jede Fragestellung einen Punkt wert.

source: Display Name <font color="red">*</font>
de_de: Anzeigename <font color="red">*</font>

source: Error refreshing answers from other students
de_de: Es ist ein Fehler beim Neuladen der Antworten anderer aufgetreten

source: Error retrieving data!
de_de: Fehler beim Abrufen der Daten!

source: Error retrieving statistics!
de_de: Fehler beim Abrufen der Statistik!

source: Error saving question
de_de: Fehler beim Speichern der Frage

source: Error submitting answer!
de_de: Fehler beim Abgeben der Antwort!

source: Example Answer {{$index + 1}}
de_de: Beispielantwort {{$index + 1}}

source: Example Answers <font color="red">*</font>
de_de: Beispielantwort <font color="red">*</font>

source: Explain to other students why you chose this answer (required):
de_de: Erklären Sie, warum Sie diese Antwort gewählt haben (erforderlich):

source: Explanation
de_de: Erklärung

source: Explanation (optional)
de_de: Erklärung (optional)

source: Explanation <font color="red">*</font>
de_de: Erklärung <font color="red">*</font>

source: First, the learner answers a multiple choice question and provides an explanation for the answer. Next, the learner sees answers and explanations submitted by other learners. After reflecting on these peer responses, the learner can make revisions and submit a final answer and explanation. Finally, the learner sees the correct answer, if supplied, and any explanation that you provided for it.
de_de: Zunächst beantwortet der Teilnehmer eine Multiple-Choice-Frage und gibt eine Erklärung für die Antwort. Anschließend sieht der Teilnehmer die Antworten und Erklärungen, die von anderen Teilnehmern eingereicht wurden. Nachdem er die Antworten der anderen Teilnehmer reflektiert hat, kann er seine überarbeiten und eine endgültige Antwort inkl. Erklärung abgeben. Schließlich sieht der Teilnehmer die richtige Antwort, sowie alle Erklärungen, die er dafür abgegeben hat.

source: In the next step, you will be shown a selection of other responses that may help you refine your answer.
de_de: In dem nächsten Schritt wird Ihnen eine Auswahl an Antworten angezeigt, welche Ihnen helfen werden, Ihre Antwort zu überarbeiten.

source: Maximum Characters <font color="red">*</font>
de_de: Maximale Anzahl an Zeichen <font color="red">*</font>

source: Minimum Characters <font color="red">*</font>
de_de: Minimale Anzahl an Zeichen <font color="red">*</font>

source: Next Step
de_de: Nächster Schritt

source: Not enough data to generate the chart. Please check back later.
de_de: Nicht genügend Daten vorhanden, um eine Tabelle zu generieren. Bitte prüfen Sie es später erneut.

source: Note:
de_de: Achtung:

source: Peer Instruction
de_de: Partner Instruktionen
eo: Péér Ìnstrüçtïön Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αм#

source: Peer instruction problems give learners more interactive engagement while they complete a multiple choice question that may or may not have a correct answer. The tool supports deeper consideration of the learner’s understanding of a concept and the correctness (if applicable) of an initial answer. Learners complete these problems in three steps.
de_de: Partnerbewertungs-Aufgaben geben den Teilnehmern die Möglichkeit, miteinander zu interagieren, während Sie z.B. eine Multiple-Choice-Aufgabe lösen. Das Werkzeug ermöglicht eine tiefere Betrachtung des Wissens der Teilnehmer über das Konzept und die Richtigkeit (falls zutreffend) einer ersten Antwort. Die Aufgabe wird in drei Schritten bearbeitet.

source: Please refresh the page and try again!
de_de: Bitte laden Sie die Seite erneut und versuchen Sie es noch einmal!

source: Possible Answers <font color="red">*</font>
de_de: Mögliche Antworten <font color="red">*</font>

source: Problem Weight
de_de: Gewichtung der Fragestellung
eo: Prößlém Wéïght Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт#

source: Provide alternative text - a description of the image for non-visual users. The description should provide all the information needed for someone to answer the question if the image did not load.
de_de: Alternativer Text - eine Beschreibung des Bildes für einen blinden Nutzer. Diese Beschreibung sollte den Nutzer mit allen relevanten Informationen versorgen, welche benötigt werden, um die Frage zu beantworten.

source: Provide an explanation for this answer.
de_de: Bitte geben Sie eine Erklärung zu dieser Antwort.

source: Question
de_de: Frage

source: Question Text <font color="red">*</font>
de_de: Fragetext <font color="red">*</font>

source: Reflection
de_de: Reflektion

source: Refreshing...
de_de: Aktualisiert...

source: Remove
de_de: Entfernen

source: Remove Image
de_de: Entferne Abbildung

source: Results
de_de: Ergebnisse

source: Revise Answer
de_de: Antwort kontrollieren

source: Save
de_de: Speichern

source: Saving
de_de: Speichert

source: Show other samples
de_de: Andere Beispiele zeigen

source: Step 1) Give Initial Answer <span class="inline-hint">You can change this answer later, if you change your mind.</span>
de_de: Schritt 1) Geben Sie eine Antwort <span class="inline-hint">Sie können diese Antwort zu einem späteren Zeitpunkt ändern.</span>

source: Step 2) Read Other Student Answers <p class="ubcpi-other-answers-instructions" translate="">These are randomly chosen samples of other student answers for this question. Read them and compare with your answer below. Then you may revise your answer, if you wish.</p>
de_de: Schritt 2) Lesen Sie die Antworten anderer Teilnehmer <p class="ubcpi-other-answers-instructions" translate="">Dies sind zufällig ausgewählte Antworten, welch zu dieser Frage abgegeben wurden. Lesen Sie sie und vergleichen Sie sie mit Ihrer. Vielleicht möchten Sie anschließend Ihre Antwort überarbeiten.</p>

source: Step 3) View Course-Wide Results
de_de: Schritt 3) Sehen Sie die Kursweiten Ergebnisse

source: Student Rationale
de_de: Begründung eines Teilnehmers

source: Students see the explanation after seeing the final answer.
de_de: Teilnehmer sehen zuerst Ihre finale Antwort und anschließend die Erklärung.

source: Submit Answer
de_de: Antwort einreichen

source: Submitting
de_de: Einreichen

source: The answers appear as choices underneath the question, with a maximum of 10 allowed per question. Each answer may contain text, an image, or a combination of both. <br><br>To add another answer press the "Add New Answer" button. To remove an answer press the blue "x" next to the blue option you want to remove.
de_de: Die Antworten erscheinen als Auswahlmöglichkeiten unterhalb der Frage, wobei maximal 10 pro Frage zulässig sind. Jede Antwort kann Text, Bild oder eine Kombination aus beidem enthalten. <br> <br>Um eine weitere Antwort hinzuzufügen, klicken Sie auf die Schaltfläche "Neue Antwort hinzufügen". Um eine Antwort zu entfernen, drücken Sie auf das blaue "x" neben der blauen Option, die Sie entfernen möchten.

source: The question appears above the possible answers that you set below. You can use text, an image, or a combination of both. If you wish to add an image to your question, press the "Add Image To Question" button.
de_de: Die Frage, die die Teilnehmer sehen. Diese Frage erscheint über den Antwortmöglichkeiten, die Sie unten festlegen. Sie können einen Text, ein Bild oder eine Kombination aus beiden verwenden. Wenn Sie möchten können Sie ein Bild zu Ihrer Frage hinzufügen, indem Sie auf 'Bild hinzufügen' klicken.

source: These are randomly chosen samples of other student answers for this question. Read them and compare with your answer below. Then you may revise your answer, if you wish.
de_de: Dies sind zufällig ausgewählte Beispiele anderer Teilnehmerantworten für diese Frage. Lesen Sie diese und vergleichen Sie sie mit Ihrer Antwort. Vielleicht möchten Sie anschließend Ihre Antwort überarbeiten.

source: This is a look at how your classmates answered the question initially and after revision.
de_de: Dies gibt Ihnen eine Vorstellung darüber, wie die ersten und die finalen Antworten anderer Teilnehmer aussehen.

source: This is the maximum number of characters the student explanations may contain.
de_de: Dies ist die maximale Anzahl an Zeichen, die eine Erklärung umfassen sollte.

source: This is the minimum number of characters the student explanations must contain.
de_de: Dies ist die minimale Anzahl an Zeichen, die eine Erklärung umfassen sollte.

source: This is the number of examples shown on screen to the students after they answer. Students can choose to refresh for some other samples. Enter the # symbol to use the same number as the answer possibilities you've set.
de_de: Dies ist die Anzahl der Beispiele, die den Schülern auf dem Bildschirm gezeigt werden, nachdem sie geantwortet haben. Die Studenten können wählen, ob sie für einige andere Beispiele eine Aktualisierung wünschen. Geben Sie das Symbol # ein, um die gleiche Anzahl wie die von Ihnen festgelegten Antwortmöglichkeiten zu verwenden.

source: This name appears in the horizontal navigation at the top of the page.
de_de: Dies ist der Name, welcher in der horizontalen Navigation oben auf der Seite erscheint.

source: Upload a file first by clicking Content, then Files and Uploads. Then copy the Studio URL. Paste that into the text field here.
de_de: Laden Sie eine Datei hoch, indem Sie zuerst auf Inhalt und dann auf Dateien und Uploads klicken. Kopieren Sie dann die Studio-URL. Fügen Sie sie hier in das Textfeld ein.

source: View Question Statistics
de_de: Aufgabenstatistik ansehen

source: Warning
de_de: Warnung

source: What would you like to do?
de_de: Was möchten Sie machen?

source: You are approaching the limit of {{rationale_size.max}} characters for this answer. Characters left: {{rationale_size.max - rc.rationale.length}}
de_de: Sie erreichen die maximale Anzahl von {{rationale_size.max}} Zeichen für diese Antwort. noch verfügbare Zeichen: {{rationale_size.max - rc.rationale.length}}

source: You are unable to save this form as there are errors:
de_de: Speichern des Formulars nicht möglich, da es Fehler gibt:

source: You:
de_de: Sie:

source: Your explanation must be at least {{rationale_size.min}} characters long. Please explain further.
de_de: Ihre Erklärung muss mindestens {{rationale_size.min}} Zeichen umfassen. Bitte erklären Sie genauer.

source: Your explanation must contain fewer than {{rationale_size.max}} characters. Please trim the text.
de_de: Ihre Erklärung darf maximal {{rationale_size.max}} Zeichen umfassen. Bitte kürzen Sie Ihren Text.

source: Your final explanation:
de_de: Ihre finale Erklärung:

source: Question must have text element.
de_de: Die Frage muss ein Textelement beinhalten.

source: Missing options elements in XML definition
de_de: Fehlende Optionselemente in XML Definitionen

source: Option must have text element.
de_de: Option muss ein Textelement beinhalten.

source: Missing rationale for correct answer.
de_de: Fehlende Begründung für die richtige Antwort.

source: Only one correct answer can be defined in options.
de_de: Es kann nur eine richtige Antwort definiert werden.

source: Seed element must have an option attribute.
de_de: Ausgangselement muss ein Optionsattribut haben.

source: Every peer instruction tool must contain an "ubcpi" element.
de_de: Jedes Tool der Partnerbewertung muss ein "ubcpi" Element beinhalten.

source: Every peer instruction tool must contain a "display_name" element.
de_de: Jedes Tool der Partnerbewertung muss ein "display_name" Element beinhalten.

source: Every peer instruction must tool contain a "question" element.
de_de: Jedes Tool der Partnerbewertung muss ein "Frage" Element beinhalten.

source: Every peer instruction must tool contain a "options" element.
de_de: Jedes Tool der Partnerbewertung muss ein "Options" Element beinhalten.

source: Every peer instruction must tool contain a "seeds" element.
de_de: Jedes Tool der Partnerbewertung muss ein "Kern" Element beinhalten.

source: Missing option seed(s):
de_de: Fehlendes Ausgangselement(e):

source: Missing 1 option seed
de_de: 1 fehlende Ausgangsoption

source: Minimum Characters
de_de: Minimale Anzahl an Zeichen

source: Maximum Characters
de_de: Maximale Anzahl an Zeichen

source: Number of Responses
de_de: Anzahl der Antworten

source: Not an Integer
de_de: Das ist keine Zahl

source: Invalid Option(s):
de_de: Ungültige Option(en):

source: Peer Instruction Question
de_de: Partnerbewertungsfrage

source: <p>Where does most of the mass in a fully grown tree originate?</p>
de_de: <p>Woher kommt bei einem ausgewachsenen Baum der größte Teil der Masse?</p>
eo: <p>Whéré döés möst öf thé mäss ïn ä füllý gröwn tréé örïgïnäté?</p> Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αмєт, ¢σηѕє¢тєтυя #

source: The question the students see. This question appears above the possible answers which you set below. You can use text, an image or a combination of both. If you wish to add an image to your question, press the 'Add Image' button.
de_de: Die Frage, die die Teilnehmer sehen. Diese Frage erscheint über den Antwortmöglichkeiten, die Sie unten festlegen. Sie können einen Text, ein Bild oder eine Kombination aus beiden verwenden. Wenn Sie möchten können Sie ein Bild zu Ihrer Frage hinzufügen, indem Sie auf 'Bild hinzufügen' klicken.
eo: Thé qüéstïön thé stüdénts séé. Thïs qüéstïön äppéärs äßövé thé pössïßlé änswérs whïçh ýöü sét ßélöw. Ýöü çän üsé téxt, än ïmägé ör ä çömßïnätïön öf ßöth. Ìf ýöü wïsh tö ädd än ïmägé tö ýöür qüéstïön, préss thé 'Àdd Ìmägé' ßüttön. Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αмєт, ¢σηѕє¢тєтυя α∂ιριѕι¢ιηg єłιт, ѕє∂ ∂σ єιυѕмσ∂ тємρσя ιη¢ι∂ι∂υηт υт łαвσяє єт ∂σłσяє мαgηα αłιqυα. υт єηιм α∂ мιηιм νєηιαм, qυιѕ ησѕтяυ∂ єχєя¢ιтαтιση υłłαм¢σ łαвσяιѕ ηιѕι υт αłιqυιρ єχ єα ¢σммσ∂σ ¢σηѕєqυαт. ∂υιѕ αυтє ιяυяє ∂σłσя ιη яєρяєнєη∂єяιт ιη νσłυρтαтє νєłιт єѕѕє ¢ιłłυм ∂σłσяє є#

source: Air
de_de: Luft
eo: Àïr Ⱡ'σяєм#

source: Soil
de_de: Boden
eo: Söïl Ⱡ'σяєм ι#

source: Water
de_de: Wasser
eo: Wätér Ⱡ'σяєм ιρѕ#

source: The possible options from which the student may select
de_de: Die Antwortmöglichkeiten, aus denen die Teilnehmer wählen können.

source: The minimum and maximum number of characters a student is allowed for their rationale.
de_de: Die minimale und maximale Anzahl an Zeichen, die ein Teilnehmer für seine Begründung nutzen darf.
eo: Thé mïnïmüm änd mäxïmüm nümßér öf çhäräçtérs ä stüdént ïs ällöwéd för théïr rätïönälé. Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αмєт, ¢σηѕє¢#

source: The correct option for the question
de_de: Die richtige Option dieser Frage
eo: Thé çörréçt öptïön för thé qüéstïön Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αмєт, ¢σηѕє¢тєт#

source: Photosynthesis
de_de: Fotosynthese
eo: Phötösýnthésïs Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт#

source: The feedback for student for the correct answer
de_de: Das Feedback für Teilnehmer für die richtige Antwort
eo: Thé féédßäçk för stüdént för thé çörréçt änswér Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αмєт, ¢σηѕє¢тєтυя α#

source: Overall stats for the instructor
de_de: Statistiken für die Lehrkräfte
eo: Övéräll stäts för thé ïnstrüçtör Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αмєт, ¢σηѕє¢тє#

source: Tree gets carbon from air.
de_de: Baum bekommt Kohlenstoff aus der Luft.
eo: Tréé géts çärßön fröm äïr. Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αмєт, ¢σηѕ#

source: Tree gets minerals from soil.
de_de: Baum bekommt Mineralien aus dem Boden.
eo: Tréé géts mïnéräls fröm söïl. Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αмєт, ¢σηѕє¢#

source: Tree drinks water.
de_de: Baum trinkt Wasser.
eo: Tréé drïnks wätér. Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αмєт#

source: Instructor configured examples to give to students during the revise stage.
de_de: Eine Lehrkraft hat Beispiele hinzugefügt, welche die Teilnehmer während des Überprüfungsschrittes bekommen.
eo: Ìnstrüçtör çönfïgüréd éxämplés tö gïvé tö stüdénts dürïng thé révïsé stägé. Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αмєт, ¢σηѕє¢тєтυ#

source: System selected answers to give to students during the revise stage.
de_de: Das System wählt Antwortmöglichkeiten aus, welche den Teilnehmern während des Überprüfungsschrittes gezeigt werden.
eo: Sýstém séléçtéd änswérs tö gïvé tö stüdénts dürïng thé révïsé stägé. Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αмєт, ¢σηѕє¢тєтυя #

source: Stores the specific answers of other students shown, for a given student.
de_de: Speichert die Antworten von anderen Teilnehmern, um diese anderen Teilnehmern anzuzeigen.

source: In case the student requested to see more answers, these are the answers previously shown.
de_de: Dies die zuvor angezeigten Antworten, für den Fall, dass der Teilnehmer mehr Antworten sehen will.

source: Keep track of the number of refreshes for each option
de_de: Verfolgen Sie die Anzahl der Aktualisierungen für jede Option

source: The algorithm for selecting which answers to be presented to students
de_de: Der Algorithmus für die Auswahl an Antworten, die gezeigt werden.
eo: Thé älgörïthm för séléçtïng whïçh änswérs tö ßé préséntéd tö stüdénts Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αмєт, ¢σηѕє¢тєтυя #

source: ISO-8601 formatted string representing the start date of this assignment. We ignore this.
de_de: Der ISO-8601 formatierter String steht für das Startdatum dieses Fachs. Wir ignorieren dies.
eo: ÌSÖ-8601 förmättéd strïng répréséntïng thé stärt däté öf thïs ässïgnmént. Wé ïgnöré thïs. Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αмєт, ¢σηѕ#

source: ISO-8601 formatted string representing the due date of this assignment. We ignore this.
de_de: Der ISO-8601 formatierter String steht für das Enddatum dieses Fachs. Wir ignorieren dies.
eo: ÌSÖ-8601 förmättéd strïng répréséntïng thé düé däté öf thïs ässïgnmént. Wé ïgnöré thïs. Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αмєт, ¢σηѕє#

source: System will select one of each option to present to the students.
de_de: Das System wird eine von jeder Möglichkeit wählen, und dem Teilnehmer zeigen.
eo: Sýstém wïll séléçt öné öf éäçh öptïön tö présént tö thé stüdénts. Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αмєт, ¢σηѕє¢тєтυя α#

source: Completely random selection from the response pool.
de_de: Komplett zufällige Auswahl aus dem Antwortenpool.
eo: Çömplétélý rändöm séléçtïön fröm thé réspönsé pööl. Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αмєт, ¢σηѕє¢тєтυя α#

source: Appears above
de_de: Erscheint darüber
eo: Àppéärs äßövé Ⱡ'σяєм ιρѕυм ∂σłσя ѕι#

source: Appears below
de_de: Erscheint darunter
eo: Àppéärs ßélöw Ⱡ'σяєм ιρѕυм ∂σłσя ѕι#
