Repository: pypi-data/pypi-mirror-81
Catalog: packages/karbor-dashboard/karbor-dashboard-1.5.1.tar.gz/karbor-dashboard-1.5.1/karbor_dashboard/locale/*/LC_MESSAGES/django.po
Languages: de

source: Actual Start Time
de: Tatsächliche Startzeit

source: Associate with Trigger
de: Verknüpfen mit Trigger

# Task status of an Checkpoint
source: Available
de: Verfügbar

source: Check Point Details
de: Kontrollpunkt Details

source: Checkpoint ID
de: Kontrollpunkt ID

source: Checkpoint restore initiated
de: Kontrollpunktwiederherstellung initiert

source: Checkpoints
de: Kontrollpunkte

source: Create Protection Plan
de: Schutzplan erstellen

source: Create Trigger
de: Auslöser erstellen

source: Create a new trigger.
de: Neuen Auslöser erstellen.

source: Date
de: Datum

source: Day
de: Tag

source: Delete Checkpoint
de: Lösche Kontrollpunkt

source: Delete Protection Plan
de: Lösche Schutzplan

source: Delete Scheduled Operation
de: Lösche geplante Operation

source: Delete Trigger
de: Auslöser löschen

# Task status of an Checkpoint
source: Deleted
de: Gelöscht

source: Deleted Scheduled Operation
de: Geplante Operation gelöscht

source: Deleted Trigger
de: Gelöschter Auslöser

# Task status of an Checkpoint
source: Deleting
de: Löschen

source: Description
de: Beschreibung

source: Description:
de: Beschreibung:

source: Edit Plan
de: Bearbeite Plan

source: End Time
de: Endzeit

# Task status of an Checkpoint
source: Error
de: Fehler

# Task status of an Checkpoint
source: Error Deleting
de: Fehler beim Löschen

source: Event Trigger
de: Ereignis-Auslöser

source: Every Day
de: Jeden Tag

source: Every Month
de: Jeden Monat

source: Every Week
de: Jede Woche

source: Execution Interval
de: Ausführungsinterval

source: Execution Time (HH:MM)
de: Ausführungszeit (HH:MM)

source: Expect Start Time
de: Erwartete Startzeit

# Task status of an Restore
source: Fail
de: Fehlgeschlagen

source: Frequence
de: Frequenz

source: Friday
de: Freitag

source: Hour
de: Stunde

# Task status of an Restore
source: In Progress
de: In Arbeit

source: Lastest one month
de: Letzter Monat

source: Lastest one week
de: Letzte Woche

source: Lastest three months
de: Letzte drei Monate

source: Lastest two weeks
de: Letzte zwei Wochen

source: Monday
de: Montag

source: Operation Logs
de: Betriebsprotokolle

source: Operation Type
de: Betriebstyp

source: Options Schema
de: Schemaoptionen

source: Plan protection initiated
de: Schutzplan initiiert

source: Protect Now
de: Jetzt schützen

source: Protect now successfully.
de: Schutz ist jetzt erfolgreich.

# Task status of an Checkpoint
source: Protecting
de: Schützen

source: Protection Plan
de: Schutzplan

source: Protection Plan Details
de: Details des Protektion Plans

source: Protection Plan created successfully.
de: Schutzplan erfolgreich erstellt.

source: Protection Plan updated successfully.
de: Schutzplan erfolgreich aktualisiert.

source: Protection Plans
de: Schutzpläne

source: Protection Provider
de: Schutzanbieter

source: Protection Provider Details
de: Details der Protektion Provider

source: Protection Resources
de: Schutzressourcen

source: Provider Description
de: Anbieterbeschreibung

source: Provider ID
de: Anbieter-ID

source: Provider Name
de: Anbietername

source: Restore Checkpoint
de: Stelle Kontrolpunkt wieder her

source: Restore From Checkpoint
de: Stelle Kontrolpunkt wieder her

source: Restore Schema
de: Stelle Schema wieder her

source: Restore Target
de: Wiederherstellungsziel

source: Restore Target Password
de: Ziel-Passwort wiederherstellen

source: Restore Target Username
de: Ziel-Benutzername wiederherstellen

source: Restore Target, Restore Target Username and Restore Target Password must be assigned at the same time or not assigned.
de: Wiederherstellungsziel, Wiederherstellungszielbenutzername und Wiederherstellungszielkennwort müssen zur gleichen Zeit zugewiesen oder nicht zugewiesen werden.

source: Restores
de: Wiederherstellungen

source: SU
de: So

source: Saturday
de: Samstag

source: Saved Info Schema
de: Gespeicherte Schemainformationen

source: Schedule Protect
de: Schutzplan

source: Schedule Protect.
de: Schutzplan

source: Schedule protect successfully.
de: Schutzplan erfolgreich.

source: Scheduled Operations
de: Geplante Operationen

source: Scheduled deletion of Checkpoint
de: Geplante Löschung des Kontrollpunkts

source: Show Checkpoints
de: Zeige Kontrollpunkte

source: State
de: Zustand

# Task status of an Restore
source: Success
de: Erfolg

source: Sunday
de: Sonntag

source: TH
de: Do

source: TU
de: Di

source: Thursday
de: Donnerstag

source: Time Trigger
de: Zeit-Auslöser

source: Today
de: Heute

source: Trigger
de: Auslöser

source: Trigger Details
de: Auslöser erstellen

source: Trigger Name
de: Auslösername

source: Trigger Type
de: Auslösertyp

source: Trigger created successfully.
de: Auslöser erfolgreich erstellt

source: Triggers
de: Auslöser

source: Tuesday
de: Dienstag

source: Type
de: Typ

source: Unable to create protection plan.
de: Konnte Schutzplan nicht erstellen.

source: Unable to create trigger.
de: Auslöser kann nicht erstellt werden.

source: Unable to get instances.
de: Instanzen können nicht abgerufen werden.

source: Unable to protect now
de: Konnte jetzt nicht schützen

source: Unable to restore checkpoint.
de: Der Kontrollpunkt kann nicht wiederhergestellt werden.

source: Unable to retrieve anyone provider.
de: Kann keinen Anbieter abrufen.

source: Unable to retrieve checkpoint details.
de: Die Details des Kontrollpunktes können nicht abgerufen werden.

source: Unable to retrieve checkpoints list.
de: Liste der Kontrollpunkte kann nicht abgerufen werden.

source: Unable to retrieve protection plan details.
de: Protektion Plan kann nicht abgerufen werden.

source: Unable to retrieve protection plans list.
de: Konnte Schutzplanliste nicht abrufen

source: Unable to retrieve protection provider details.
de: Details der Protektion Provider können nicht abgerufen werden.

source: Unable to retrieve protection providers list.
de: Die Liste der Protektion Provider kann nicht abgerufen werden.

source: Unable to retrieve protection resources.
de: Konnte Schutzplanresourcen nicht abrufen

source: Unable to retrieve provider contents.
de: Anbieterinhalte können nicht abgerufen werden.

source: Unable to retrieve provider details.
de: Konnte Schutzanbieterdetails nicht abrufen

source: Unable to retrieve restore list.
de: Wiederherstellungsliste kann nicht abgerufen werden.

source: Unable to retrieve scheduled operation list.
de: Die Liste der geplanten Operationen kann nicht abgerufen werden.

source: Unable to retrieve trigger details.
de: Auslöserdetails können nicht abgerufen werden.

source: Unable to retrieve triggers list.
de: Auslöserliste kann nicht abgerufen werden.

source: Unable to schedule protect.
de: Schutzplan nicht erfolgreich.

source: Unable to update protection plan.
de: Konnte Schutzplan nicht aktualisieren.

source: Update Protection Plan
de: Schutzplan aktualisieren

source: Use current session credentials
de: Benutze aktuelle Session Anmeldeinformationen

source: WE
de: Mi

source: Wednesday
de: Mittwoch

source: checkpoint list can not be retrieved.
de: Kontrollpunktliste kann nicht abgerufen werden.
