#!/usr/bin/env python3
"""
Пример текстового процессора для Astresay. Аргументом для него
выступает текст, полученный в процессе работы диалога.
"""
import sys

# Текст из буфера диалога приходит одним параметром.
src_text = sys.argv[1]
dst_text = ''

#######################
# Начало вашего кода. #
#######################


# Производим операции над текстом, чтобы получить нужный результат.
# Для примера выведем последнее слово.
words = [x for x in src_text.split(' ') if x]
dst_text = words[-1] if words else ''


######################
# Конец вашего кода. #
######################

# Выводим на стандартный вывод текст, чтобы передать его обратно в диалог.
print(dst_text)

# Обязательно указываем, что плагин успешно завершён, чтобы не прервать диалог.
sys.exit()
